#ifndef _ADC_H         //防止重复定义（ 开头）
#define _ADC_H

#include "common.h"    //包含公共要素头文件


//===========================================================================
//函数名称：adc_init
//功能概要：初始化adc模块                                                
//参数说明：channel：通道号
//       accurary采样精度:单端8-10-12
//===========================================================================
void ADC_Config(uint8_t channel);

//===========================================================================
//函数名称：adc_read
//功能概要：进行一次AD采样
//参数说明：channel：单端输入 通道范围 0~ 31
//===========================================================================
uint16_t ADC_Get(uint8_t channel);

//============================================================================
//函数名称：ad_mid
//函数返回：16位无符号的AD值，中值滤波后的结果(范围:0-4095)
//参数说明：channel：通道号
//功能概要：采样三次，取中值
//============================================================================
uint16_t ADC_Mid(uint8_t channel);

//============================================================================
//函数名称：ad_ave
//函数返回：16位无符号的AD值，中值+均值滤波后的结果(范围:0~4095)
//参数说明：channel：通道号
//      N:均值次数(范围:0~255)，每次调用中值滤波获得
//功能概要：中值+均值滤波,实际采样次数=3*N
//============================================================================
uint16_t ADC_Ave(uint8_t channel, int N);

#endif                 //防止重复定义（ 开头）
